# SQL Subqueries - Lab

## Introduction

Now that you've seen how subqueries work, it's time to get some practice writing them! Not all of the queries will require subqueries, but all will be a bit more complex and require some thought and review about aggregates, grouping, ordering, filtering, joins and subqueries. Good luck!  

## Objectives

You will be able to:

* Write subqueries to decompose complex queries

## CRM Database Schema

Once again, here's the schema for the CRM database you'll continue to practice with.

<img src="images/Database-Schema.png" width="600">

## Connect to the Database

As usual, start by importing the necessary packages and connecting to the database **data.sqlite**.

In [2]:
#Your code here; import the necessary packages
import sqlite3
import pandas as pd
conn=sqlite3.connect("data.sqlite")
cursor=conn.cursor()

In [3]:
#Your code here; create the connection and cursor

## Write an Equivalent Query using a Subquery

```SQL
select customerNumber,
       contactLastName,
       contactFirstName
       from customers
       join orders 
       using(customerNumber)
       where orderDate = '2003-01-31';
```

In [4]:
#Your code here; use a subquery. No join will be necessary.
query1='''select customerNumber,
       contactLastName,
       contactFirstName
       from customers
       where customernumber in (select customernumber from orders
       where orderDate = '2003-01-31')'''
pd.read_sql_query(query1,conn)

  customerNumber contactLastName contactFirstName
0            141          Freyre           Diego

## Select the Total Number of Orders for Each Product Name

Sort the results by the total number of items sold for that product.

In [11]:
#Your code here
query2= '''select productcode, productname from products
join (select productcode, sum(quantityordered) as order_sum
from orderdetails group by productcode) using(productcode)'''
pd.read_sql_query(query2,conn)

    productCode                                  productName
0      S10_1678        1969 Harley Davidson Ultimate Chopper
1      S10_1949                     1952 Alpine Renault 1300
2      S10_2016                        1996 Moto Guzzi 1100i
3      S10_4698         2003 Harley-Davidson Eagle Drag Bike
4      S10_4757                          1972 Alfa Romeo GTA
5      S10_4962                       1962 LanciaA Delta 16V
6      S12_1099                            1968 Ford Mustang
7      S12_1108                            2001 Ferrari Enzo
8      S12_1666                               1958 Setra Bus
9      S12_2823                             2002 Suzuki XREO
10     S12_3148                           1969 Corvair Monza
11     S12_3380                           1968 Dodge Charger
12     S12_3891                             1969 Ford Falcon
13     S12_3990                      1970 Plymouth Hemi Cuda
14     S12_4473                            1957 Chevy Pickup
15     S12_4675                           1969 Dodge Charger
16     S18_1097                       1940 Ford Pickup Truck
17     S18_1129                              1993 Mazda RX-7
18     S18_1342                         1937 Lincoln Berline
19     S18_1367     1936 Mercedes-Benz 500K Special Roadster
20     S18_1589                        1965 Aston Martin DB5
21     S18_1662                  1980s Black Hawk Helicopter
22     S18_1749                     1917 Grand Touring Sedan
23     S18_1889                  1948 Porsche 356-A Roadster
24     S18_1984                             1995 Honda Civic
25     S18_2238               1998 Chrysler Plymouth Prowler
26     S18_2248                           1911 Ford Town Car
27     S18_2319                       1964 Mercedes Tour Bus
28     S18_2325                    1932 Model A Ford J-Coupe
29     S18_2432                        1926 Ford Fire Engine
..          ...                                          ...
79     S24_4048            1992 Porsche Cayenne Turbo Silver
80     S24_4258                        1936 Chrysler Airflow
81     S24_4278                      1900s Vintage Tri-Plane
82     S24_4620                        1961 Chevrolet Impala
83     S32_1268                  1980’s GM Manhattan Express
84     S32_1374                             1997 BMW F650 ST
85     S32_2206                            1982 Ducati 996 R
86     S32_2509                  1954 Greyhound Scenicruiser
87     S32_3207       1950's Chicago Surface Lines Streetcar
88     S32_3522  1996 Peterbilt 379 Stake Bed with Outrigger
89     S32_4289                     1928 Ford Phaeton Deluxe
90     S32_4485                    1974 Ducati 350 Mk3 Desmo
91     S50_1341                 1930 Buick Marquette Phaeton
92     S50_1392             Diamond T620 Semi-Skirted Tanker
93     S50_1514               1962 City of Detroit Streetcar
94     S50_4713                           2002 Yamaha YZR M1
95    S700_1138                        The Schooner Bluenose
96    S700_1691                  American Airlines: B767-300
97    S700_1938                                The Mayflower
98    S700_2047                                   HMS Bounty
99    S700_2466               America West Airlines B757-200
100   S700_2610                    The USS Constitution Ship
101   S700_2824                              1982 Camaro Z28
102   S700_2834                                ATA: B757-300
103   S700_3167                           F/A 18 Hornet 1/72
104   S700_3505                                  The Titanic
105   S700_3962                               The Queen Mary
106   S700_4002                    American Airlines: MD-11S
107    S72_1253                             Boeing X-32A JSF
108    S72_3212                                   Pont Yacht

[109 rows x 2 columns]

## Select the Product Name and the  Total Number of People Who Have Ordered Each Product

Sort the results in descending order.

In [ ]:
#Your code here

## Select the Employee Number, Office Code, City (of the office), and Name (First and Last) of those Employees who Sold Products that Have Been Ordered by Less Then 20 people.

This problem is a bit tougher. To start, think about how you might break the problem up. Be sure that your results only list each employee once.

In [ ]:
#Your code here

## Select the Employee Number, Name (First and Last) and Number of Customers of Employees Who's Customers Have an Average Credit Limit of Over 15K

In [ ]:
#Your code here

## Summary

In this lesson, you got to practice some more complex SQL queries, some of which required subqueries. There's still plenty more SQL to be had though; hope you've been enjoying some of these puzzles!